Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: An array of subsequences, split from this collection’s elements.
ja: このコレクションの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of subsequences, split from this sequence’s elements.
ja: このシーケンスの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of the elements that isIncluded allowed.
ja: isIncludedが許可する要素からなる配列。

source: An array of the non-nil results of calling transform with each element of the sequence.
ja: シーケンスの各要素でtransformを呼ぶことの非nilの結果の配列。

source: An array of this sequence’s elements in a shuffled order.
ja: このシーケンスの持つ要素からなる配列、シャッフルされた順番で。

source: An array that is the sole owner of its storage can perform mutating operations in place.
ja: それのストレージのただ一人のオーナーである配列は、変化を伴う操作をそこで実行することができます。

source: An array to compare.
ja: 比較する配列。

source: An array value converts to an MLDataValue.ValueType.sequence.
ja: 配列値は、MLDataValue.ValueType.sequenceに変わります。

source: An asychronous sequence of Unicode scalar values.
ja: ユニコードスカラー値それらからなるある非同期シーケンス。

source: An asychronous sequence of characters.
ja: 文字列いくつかからなるある非同期シーケンス。

source: An asychronous sequence of lines of text.
ja: テキスト行それらからなる非同期シーケンス。

source: An asynchronous sequence called RankCounter produces all elements of the array.
ja: RankCounterと呼ばれる非同期シーケンスは、その配列のすべての要素を取り出します。

source: An asynchronous sequence of the initial, consecutive elements that satisfy predicate.
ja: 冒頭の、predicateを満たす連続した要素それらからなるある非同期シーケンス。

source: An asynchronous sequence starting at the beginning of the base sequence with at most count elements.
ja: 基底シーケンスの先端で始まる多くともcount要素の非同期シーケンス。

source: An asynchronous sequence that concatenates the results of calling a given error-throwing transformation with each element of this sequence.
ja: ある非同期シーケンス、それは与えられたエラースロー変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: An asynchronous sequence that concatenates the results of calling a given transformation with each element of this sequence.
ja: ある非同期シーケンス、それは与えられた変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: An asynchronous sequence that contains, in order, the elements of the base sequence that satisfy a given predicate.
ja: ある非同期シーケンス、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられた述部を満たすものです。

source: An asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given error-throwing predicate.
ja: ある非同期シーケンス、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられたエラースロー述部を満たすものです。

source: An asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンス、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられた述部を満たすものです。

source: An asynchronous sequence that contains, in order, the elements produced by the transform closure.
ja: ある非同期シーケンス、それはtransformクロージャによって生み出された要素それらを、順番に含みます。

source: An asynchronous sequence that contains, in order, the non-nil elements produced by the transform closure.
ja: ある非同期シーケンス、それはtransformクロージャによって生み出された非nil要素それらを、順番に含みます。

source: An asynchronous sequence that drops the first count elements from the base sequence.
ja: ある非同期シーケンス、それは最初のcount要素を基底シーケンスから抜かします。

source: An asynchronous sequence that maps a given closure over the asynchronous sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンス、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: An asynchronous sequence that maps an error-throwing closure over the base sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンス、それはあるエラースロークロージャを基底シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: An asynchronous sequence that maps the given closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンス、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: An asynchronous sequence that maps the given error-throwing closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンス、それは与えられたエラースロークロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: An asynchronous sequence that skips over values from the base sequence until the provided closure returns false.
ja: ある非同期シーケンス、それは基底シーケンスから値それらを、この提供されたクロージャがfalseを返すまで飛び越えるものです。

source: An asynchronous sequence that skips over values until the provided closure returns false or throws an error.
ja: ある非同期シーケンス、それは値それらを、この提供されたクロージャがfalseを返すかエラーをスローするまで飛び越えるものです。

source: An asynchronous sequence which omits a specified number of elements from the base asynchronous sequence, then passes through all remaining elements.
ja: ある非同期シーケンス、それは指定された数の要素を基底非同期シーケンスから省きます、それから全ての残りの要素をずっと渡します。

source: An asynchronous sequence which omits elements from the base sequence until a given closure returns false, after which it passes through all remaining elements.
ja: ある非同期シーケンス、それは要素を基底シーケンスから、ある与えられたクロージャがfalseを返すまで省きます、それの後それは全ての残りの要素をずっと渡します。

source: An asynchronous sequence which omits elements from the base sequence until a given error-throwing closure returns false, after which it passes through all remaining elements.
ja: ある非同期シーケンス、それは要素を基底シーケンスから、ある与えられたエラースロークロージャがfalseを返すまで省きます、それの後それは全ての残りの要素をずっと渡します。

source: An asynchronous sequence, containing the initial, consecutive elements of the base sequence that satisfy a given predicate.
ja: ある非同期シーケンス、それは基底シーケンスの冒頭の、連続する要素いくつかを含んでいます、それらは与えられた述部を満たすものです。

source: An asynchronous sequence, containing the initial, consecutive elements of the base sequence that satisfy the given error-throwing predicate.
ja: ある非同期シーケンス、それは基底シーケンスの冒頭の、連続する要素いくつかを含んでいます、それらは与えられたエラースロー述部を満たすものです。

source: An asynchronous sequence, up to a specified maximum length, containing the initial elements of a base asynchronous sequence.
ja: 指定された最大長まで、その基盤非同期シーケンスの冒頭の要素を含んでいる、ある非同期シーケンス。

source: An element of a collection is located under the same index in a slice as in the base collection, as long as neither the collection nor the slice has been mutated since the slice was created.
ja: コレクションのある要素は、基盤となるコレクションの中と同じスライスの中のインデックスのもとに位置を突き止められます、コレクションもスライスもスライスが作成された時からずっと変化していない限りは。

source: An element to search for in the collection.
ja: このコレクションにおいて捜される要素。

source: An empty array literal alone doesn’t provide enough information for the compiler to infer the intended type of the Array instance.
ja: 空の配列リテラルそれだけでは、コンパイラがArrayインスタンスの意図される型を推論するのに十分な情報を提供していません。

source: An empty tuple.
ja: 空のタプル。

source: An end value to limit the sequence.
ja: シーケンスに限界を設けるための終了値。

source: An enumeration of the elements of a sequence or collection.
ja: シーケンスまたはコレクションの要素の列挙。

source: An equivalent range must be representable as a closed range.
ja: 同等の範囲が、完結範囲として表現可能でなければなりません。

source: An error that occurs during the decoding of a value.
ja: ある値のデコーディングの間に起こるエラー。

source: An error that occurs during the encoding of a value.
ja: ある値のエンコーディングの間に起こるエラー。

source: An error-throwing closure that takes an element as a parameter and returns a Boolean value indicating whether to drop the element from the modified sequence.
ja: あるエラースロークロージャ、それはある要素をパラメータとして取り、その要素をこの修正後のシーケンスから抜かすことになるかどうかを指し示すブール値を返すものです。

source: An error-throwing closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether to include the element in the filtered sequence.
ja: あるエラースロークロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素をこの平坦化されたシーケンスに含むことになるかどうかを指し示すブール値を返します。

source: An error-throwing mapping closure.
ja: あるエラースローマッピングクロージャ。

source: An extended-precision, floating-point value type.
ja: 拡張倍精度、浮動小数点値型。

source: An implementation detail of key path expressions; do not use this protocol directly.
ja: キーパス式の実装詳細；このプロトコルを直接に使わないでください。

source: An index offset by distance from the index i, unless that index would be beyond limit in the direction of movement.
ja: distanceだけインデックスiから補われたインデックス、そのインデックスがlimitを移動方向において越える場合を除きます。

source: An index offset by distance from the index i.
ja: distanceだけインデックスiから補われるインデックス。

source: An index offset by n from the index i, unless that index would be beyond limit in the direction of movement.
ja: インデックスiからnだけ補われたインデックス、そのインデックスがlimitを移動方向において越えない限りは。

source: An index offset by n from the index i.
ja: インデックスiからnだけ補われるインデックス。

source: An index to compare.
ja: 比較するインデックス。

source: An indication that a keyed decoding container was asked for an entry for the given key, but did not contain one.
ja: キー付きデコーディングコンテナが与えられたキーに対する登録項目について尋ねられた、しかし含んでいるものがなかったことを指し示すもの。

source: An indication that a non-optional value of the given type was expected, but a null value was found.
ja: 与えられた型のある非オプショナル値が期待された、しかしnull値が見つけられたことを指し示すもの。

source: An indication that a value of the given type could not be decoded because it did not match the type of what was found in the encoded payload.
ja: 与えられた型の値がデコードできなかった、なぜならエンコードされたペイロードの中に見つけられた何かの型とそれが合致しなかったことを指し示すもの。

source: An indication that an encoder or its containers could not encode the given value.
ja: エンコーダまたはそれのコンテナが与えられた値をエンコードできなかったことを指し示すもの。

source: An indication that the data is corrupted or otherwise invalid.
ja: データが不正またはそうでなくとも無効であることを指し示すもの。

source: An individual task throws its error in the corresponding call to Group.next(), which gives you a chance to handle individual error or to let the error be rethrown by the group.
ja: 個々のタスクはそれのエラーをその対応するGroup.next()への呼び出しの中でスローします、それはあなたに個々のエラーを取り扱うためのまたはそのエラーをグループによって再スローさせるための機会を与えます。

source: An insertion.
ja: ある挿入。

source: An instance of AnySequence forwards its operations to an underlying base sequence having the same Element type, hiding the specifics of the underlying sequence.
ja: AnySequenceのインスタンスは、同じElement型を持つある基礎をなす基盤シーケンスへと操作を転送します、基礎をなすシーケンスの特殊化を隠します。

source: An instance of StringInterpolation which has had each segment of the string literal appended to it.
ja: StringInterpolationのインスタンス、それはそれへと加えられた文字列リテラルの各文節を持っています。

source: An instance of UnsafeContinuation that hasn’t yet been resumed.
ja: UnsafeContinuationのあるインスタンスで、まだ再開されていないもの。

source: An instance of a hashable type can reduce its value mathematically to a single integer, which is used internally by sets and dictionaries to make lookups consistently fast.
ja: hashable型のインスタンスは、それの値を単一の整数へと数学的に還元できます、それは検索を常に高速なものにするために集合と辞書によって内部的に使われます。

source: An instance of a class.
ja: あるクラスのインスタンス。

source: An instance of an observer class manages information about changes made to one or more properties.
ja: オブザーバクラスのあるインスタンスは、ひとつ以上のプロパティに対してなされる変更についての情報を管理します。

source: An instance of the AsyncIterator type used to produce elements of the asynchronous sequence.
ja: 非同期シーケンスの要素それらを生み出すために使われるAsyncIterator型のインスタンス。

source: An instance of this iterator wraps a base iterator and yields successive Int values, starting at zero, along with the elements of the underlying base iterator.
ja: このイテレータのインスタンスは、基盤イテレータをラップして、連続するInt値を、ゼロで開始して、基礎をなす基盤イテレータの要素と一緒に生じます。

source: An instance representing the state of the receiver with the difference applied, or nil if the difference is incompatible with the receiver’s state.
ja: 適用された差異をもつレシーバの状態を表しているインスタンス、またはnil、もし差異がレシーバのもつ状態と相容れないならば。

source: An instance to cast to type T.
ja: Tにキャストすることになるインスタンス。

source: An instance to preserve until the execution of body is completed.
ja: bodyの実行が完了するまで保護するインスタンス。

source: An instance to temporarily access through a mutable raw buffer pointer.
ja: 可変の生のバッファポインタを通して一時的にアクセスされることになるインスタンス。

source: An instance to temporarily access through a raw buffer pointer.
ja: 生のバッファポインタを通して一時的にアクセスされることになるインスタンス。

source: An instance to temporarily use via pointer.
ja: ポインタ経由で一時的に使われることになるインスタンス。

source: An integer to compare.
ja: 比較する整数。

source: An integer to convert to this type.
ja: この型へと変換する整数。

source: An integer to convert.
ja: 変換する整数。

source: An integer type that can represent both positive and negative values.
ja: 正および負の値の両方を表すことができる整数型。

source: An integer type that can represent only nonnegative values.
ja: 非負値だけを表すことができる整数型。

source: An integer type that uses a fixed size for every instance.
ja: あらゆるインスタンスに対して固定された大きさを使う整数型。

source: An integer type with a binary representation.
ja: バイナリ表現での整数型。

source: An integer value converts to an MLDataValue.ValueType.int.
ja: 整数値は、MLDataValue.ValueType.intに変わります。

source: An integer value.
ja: ある整数値。

source: An interval from a lower bound up to, and including, an upper bound.
ja: 下側の境界から、上側の境界までの、そしてそれを含む、間隔。

source: An iterator for a StrideThrough instance.
ja: StrideThroughインスタンスのためのイテレータ。

source: An iterator for a StrideTo instance.
ja: StrideToインスタンスのためのイテレータ。

source: An iterator of code units to be translated, encoded as inputEncoding.
ja: 翻訳されることになるいくらかのコードユニットからなるあるイテレータ、inputEncodingとしてエンコードされます。

source: An iterator over the dictionary with elements of type (key: Key, value: Value).
ja: 型(key: Key, value: Value)の要素を持つ辞書のすべてを対象とするイテレータ。

source: An iterator over the members of a Dictionary<Key, Value>.
ja: Dictionary<Key, Value>のメンバーすべてを対象とするイテレータ。

source: An iterator that never produces an element.
ja: 決して要素を生成しないイテレータ。

source: An iterator that produces one or zero instances of an element.
ja: ある要素のインスタンスを１つまたは０個生み出すイテレータ。

source: An iterator to type-erase.
ja: 型消去することになるイテレータ。

source: An object representing a dynamic collection of key-value pairs, for use instead of a Dictionary variable in cases that require reference semantics.
ja: キー値ペアからなる動的なコレクションを表しているオブジェクト、参照意味論を必要とする場合にDictionary変数の代わりに使うため。

source: An object representing a dynamic ordered collection, for use instead of an Array variable in cases that require reference semantics.
ja: 静的な順序付きコレクションを表しているオブジェクト、参照意味論を必要とする場合にArray変数の代わりに使うため。

source: An object representing a static collection of key-value pairs, for use instead of a Dictionary constant in cases that require reference semantics.
ja: キー値ペアからなる静的なコレクションを表しているオブジェクト、参照意味論を必要とする場合にDictionary定数の代わりに使うため。

source: An object representing a static ordered collection, for use instead of an Array constant in cases that require reference semantics.
ja: 静的な順序付きコレクションを表しているオブジェクト、参照意味論を必要とする場合にArray定数の代わりに使うため。

source: An optional value.
ja: オプショナル値。

source: An ordered, asynchronously generated sequence of elements.
ja: いくつかの要素からなる、順番をつけられた、非同期に生成されたシーケンス。

source: An ordered, random-access collection.
ja: 順序付けられた、無作為アクセスのコレクション。

source: An output stream to receive the text representation of each item.
ja: 各項目のテキスト表現を受け取る出力ストリーム。

source: An output stream.
ja: ある出力ストリーム。

source: An overshift results in -1 for a negative value of lhs or 0 for a nonnegative value.
ja: オーバーシフトは、負の値のlhsに対して-1または非負値に対して0という結果になります。

source: An unkeyed container view into this decoder.
ja: このデコーダへのキー無しコンテナビュー。

source: An unowned reference to a serial executor (a SerialExecutor value).
ja: ある直列遂行者（シリアルエグゼキュータ）への非所有参照（SerialExecutor値）。

source: An unsigned, fixed-width integer type can represent values from 0 through (2 ** bitWidth) - 1, where ** is exponentiation.
ja: 符号なしの、固定長整数型は、０から(2 ** bitWidth) - 1までの値を表せます、そこで**は冪演算です。

source: And because ArraySlice presents the same interface as Array, you can generally perform the same operations on a slice as you could on the original array.
ja: そしてArraySliceはArrayと同じインターフェイスを提供するので、あなたは一般的にあなたが元の配列上でできるのと同じ操作をスライス上で実行できます。

source: And here’s how Swift imports it:
ja: そしてここにスウィフトがそれをインポートする方法があります：

source: Annotate a Property for Key-Value Observing
ja: キー値監視のためのプロパティに注釈をつける

source: Another array to compare.
ja: 比較するもう一方の配列。

source: Another floating-point value.
ja: もう１つの浮動小数点値。

source: Another index to compare.
ja: もう一方の比較するインデックス。

source: Another integer to compare.
ja: 比較するもう一方の整数。

source: Another integer value.
ja: もう１つの整数値。

source: Another range to compare.
ja: もう一方の比較する範囲。

source: Another range-replaceable collection.
ja: もう一方の範囲置換可能なコレクション。

source: Another reference to compare.
ja: もう一方の比較する参照。

source: Another tuple of elements of the same type as lhs.
ja: lhsと同じ型の要素からなる別のタプル。

source: Another type to compare.
ja: 比較するもう一方の型。

source: Another type-erased hashable value.
ja: もう一方の型消去ハッシュ可能値。

source: Another valid index of the collection.
ja: コレクションの別の有効なインデックス。

source: Another value to compare.
ja: もう一方の比較する値。

source: Any contextual information set by the user for decoding.
ja: デコーディングに対するユーザによって設定される何らかの前後関係情報。

source: Any contextual information set by the user for encoding.
ja: エンコーディングのためのユーザによって設定される何らかの前後関係情報。

source: Any fractional part of value is removed, rounding the resulting value toward zero.
ja: valueの小数部分は何であれ取り除かれます、結果となる値はゼロへと丸められます。

source: Any fractional part of the value passed as source is removed, rounding the value toward zero.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます、値はゼロへと丸められます。

source: Any fractional part of the value passed as source is removed.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます。

source: Any padding is performed by sign-extending the passed value.
ja: あらゆる詰め物は、渡された値を符号拡張することによって実行されます。

source: Any public Objective-C headers listed in the bridging header are visible to Swift.
ja: ブリッジヘッダにおいて列記されるあらゆるパブリックObjective-Cヘッダは、Swiftにとって見ることが可能です。

source: Any such case that next is invoked concurrently and contends with another call to next is a programmer error and will fatalError.
ja: nextが並行的に発動されるそしてnextへの別の呼び出しと争うようなどんな場合も、プログラマの誤りです、そしてfatalErrorでしょう。

source: Any type that conforms to the Hashable protocol can be used as a dictionary’s Key type, including all of Swift’s basic types.
ja: Swiftの基本的な型のすべてを含めて、Hashableプロトコルに準拠するあらゆる型は、辞書のKey型として使われることができます。

source: Any type that declares conformance to the Error protocol can be used to represent an error in Swift’s error handling system.
ja: Errorプロトコルへの準拠を宣言するあらゆる型は、エラーをSwiftのエラー処理システムにおいて表すために使われることができます。

source: Any value whose magnitude is so great that it would round to a value outside the range of representable numbers is rounded to infinity.
ja: それの規模が大きすぎるので表現可能な数の範囲外の値に丸められるであろう何らかの値は、無限大に丸められます。

source: Append operations that trigger reallocation have a performance cost, but they occur less and less often as the array grows larger.
ja: 再割り当ての引き金となる追加操作はある性能コストを持ちます、しかしそれらは配列がより大きく成長するにつれて大抵ますます少ない頻度でしか生じません。

source: Appending the key path passed as path is successful only if the root type for path matches this key path’s value type.
ja: pathとして渡されるキーパスの追加は、pathのルート型がこのキーパスの持つ値型と合致する場合にのみ成功します。

source: Appends a literal segment of a string interpolation.
ja: ある文字列補間のリテラル断片を加えます。

source: Appends the elements of a sequence to a range-replaceable collection.
ja: あるシーケンスの要素を範囲置換コレクションに加えます。

source: Appends the given string to the stream.
ja: 与えられた文字列をストリームへ追加します。

source: Applies the given difference to this collection.
ja: 与えられた差異をこのコレクションに適用します。

source: Apply macros to your Objective-C APIs to customize how they're imported into Swift.
ja: マクロをあなたのObjective-C APIに適用して、それらがSwiftにインポートされる方法をカスタマイズします。

source: Archives and Serialization
ja: アーカイブとシリアライゼーション

source: Arithmetic
ja: 算術

source: Arithmetic with Assignment
ja: 代入での算術

source: Arrays are one of the most commonly used data types in an app.
ja: 配列は、アプリにおいて最も一般的に使われるデータ型の１つです。

source: Arrays need to follow a geometric allocation pattern for appending elements to achieve amortized constant-time performance.
ja: ならし定数時間性能を達成するために、配列は要素を追加するのにある幾何数級的なアロケートパターンに従う必要があります。

source: Arrays, like all variable-size collections in the standard library, use copy-on-write optimization.
ja: 配列は、標準ライブラリにおける可変サイズコレクションのすべてと同じく、コピーオンライト最適化を使います。

source: Arrays, sets, and option sets all conform to ExpressibleByArrayLiteral, and your own custom types can as well.
ja: 配列、集合、またはオプションセットは、すべてExpressibleByArrayLiteralに準拠します、そしてあなた独自のあつらえの型もまたそうできます。

source: As a result, type(of:) can only produce the concrete metatype P.Protocol.
ja: 結果として、type(of:)は具象メタタイプP.Protocolを生成することだけが可能です。

source: As a result, changing the value of a property on an instance of the imported structure changes the value of all other properties defined by that structure.
ja: 結果として、インポートされた構造体上でプロパティを変更することは、その構造体によって定義される全ての他のプロパティの値を変更します。

source: As a result, requests to the database won't accidentally change the wrong record.
ja: 結果として、データベースに対する要請は誤って相応しくないレコードを変更することはありません。

source: As a result, you can look at a section of code and be more confident that changes to instances in that section will be made explicitly, rather than being made invisibly from a tangentially related function call.
ja: 結果として、あなたはコードのある区画を調べて、その区画のインスタンスに対する変更が明確だということを、ほとんど無関係な関連する関数呼び出しから不可視に行われるよりむしろずっと自信を持てます。

source: As an associated value, this case contains the context for debugging.
ja: ある関連値として、この場合はデバッグのための前後関係を含みます。

source: As an example, consider a GridPoint type that describes a location in a grid of buttons.
ja: １つの例として、GridPoint型を考えてみてください、それはある格子状配列のボタンにおけるある場所を記述します。

source: As an example, consider a StreetAddress class that holds the parts of a street address: a house or building number, the street name, and an optional unit number.
ja: 例として、StreetAddressクラスを考えてください、それは通り住所の部分；家またはビル番地、通りの名、そして随意に戸番号を保持します。

source: As an example, here’s an implementation of a Date structure that stores the year, month, and day of a date:
ja: 例として、ある日付の年、月、そして日を格納するあるDate構造体の実装がここにあります：

source: As associated values, this case contains the attempted key and context for debugging.
ja: 関連値いくつかとして、この場合は試みられたキーとデバッグのための前後関係を含みます。

source: As associated values, this case contains the attempted type and context for debugging.
ja: 関連値いくつかとして、この場合は試みられた型とデバッグのための前後関係を含みます。

source: As associated values, this case contains the attempted value and context for debugging.
ja: 関連値いくつかとして、この場合は試みられた値とデバッグのための前後関係を含みます。

source: As in the previous example, Swift imports this Objective-C method as two methods: an asynchronous method that takes a closure, and an asynchronous throwing method.
ja: 前の例でのように、SwiftはこのObjective-Cメソッドを２つのメソッドとしてインポートします：クロージャを取る非同期メソッド、そして非同期スローメソッド。

source: As long as the predicate returns true, this method returns nil.
ja: 述部がtrueを返す限り、このメソッドはnilを返します。

source: As noted in the previous section, two instances that are considered equal must have the same hash value.
ja: 前の節で注記されるように、等しいとみなされる２つのインスタンスは、同じハッシュ値を持たなければなりません。

source: As soon as the sequence has run out of elements, all subsequent calls return nil.
ja: シーケンスが要素を使い果たすやいなや、全てのその後の呼び出しはnilを返します。

source: As the dictionary is built, the initializer calls the combine closure with the current and new values for any duplicate keys.
ja: 辞書が組み立てられるとき、このイニシャライザはcombineクロージャを何らかの重複キーに対してその現在および新規の値とともに呼び出します。

source: As the key-value pairs are merged with the dictionary, the combine closure is called with the current and new values for any duplicate keys that are encountered.
ja: それらキー値ペアが辞書に結合されるときに、出くわした全ての重複キーに対してその現在および新規の値とともにcombineクロージャが呼び出されます。

source: As the key-value pairs in other are merged with this dictionary, the combine closure is called with the current and new values for any duplicate keys that are encountered.
ja: otherの中のキー値ペアがこの辞書と結合される時、combineクロージャは、遭遇される何らかの重複キーに対して現在および新規の値とともに呼び出されます。

source: As the key-values pairs in other are merged with this dictionary, the combine closure is called with the current and new values for any duplicate keys that are encountered.
ja: otherの中のキー値ペアがこの辞書と結合されるとき、combineクロージャは、遭遇される何らかの重複キーに対して現在および新規の値とともに呼び出されます。

source: As with Sequence, you typically iterate through an AsyncSequence with a for await-in loop.
ja: Sequenceでのように、あなたは概してAsyncSequenceをfor await-inループで始めから終わりまで反復処理します。

source: As with any basic operation, if this value is outside the representable range of the type, overflow or underflow occurs, and zero, a subnormal value, or infinity may result.
ja: あらゆる基本的演算でのように、この値がその型の表現可能な範囲の外側ならば、オーバーフローまたはアンダーフローが起こります、そしてゼロ、サブノーマル値、または無限大が結果となるでしょう。

source: Associate the Observer with the Property to Observe
ja: 監視するプロパティとオブザーバを結びつける

source: Associated Types
ja: さまざまな関連型

source: AsyncStream can be initialized with the option to buffer to a given limit.
ja: AsyncStreamは、あるオプションで初期化されることで、ある与えられた限界までバッファすることが可能です。

source: AsyncStream is an interface type to adapt from code producing values to an asynchronous context iterating them.
ja: AsyncStreamは、値それらを生み出しているコードから、それらを反復処理している非同期な文脈へと適合させるあるインターフェイス型です。
